SRGDamia1/SAMD-custom-board/board_data/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_STONEFLY_M4_
#define _VARIANT_STONEFLY_M4_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator, typically 32768 Hz */
#define VARIANT_MAINOSC (32768ul)

/** Master clock frequency */
#define VARIANT_MCK (F_CPU)

/** Generic clock frequencies (SAMD51 only, remove for SAMD21)*/
#define VARIANT_GCLK0_FREQ (F_CPU)
#define VARIANT_GCLK1_FREQ (48000000UL)
#define VARIANT_GCLK2_FREQ (100000000UL)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#define PINS_COUNT (81u)
#define NUM_DIGITAL_PINS (45u)
#define NUM_ANALOG_INPUTS (19u)
#define NUM_ANALOG_OUTPUTS (2u)
// Mapping from analog pin number to digital pin number
// This can be a function if pin numbers are contiguous or it can specify the mapping for each pin explicitly.
#define analogInputToDigitalPin(p) ((p < 10)    ? 66 + (p) \
                                    : (p == 10) ? 4        \
                                    : (p == 11) ? 19       \
                                    : (p == 12) ? 20       \
                                    : (p == 13) ? 23       \
                                    : (p == 14) ? 24       \
                                    : (p == 15) ? 25       \
                                    : (p == 16) ? 26       \
                                    : (p == 17) ? 21       \
                                    : (p == 18) ? 17       \
                                                : -1)

// These macros are used to map digital pin numbers to their corresponding port registers and bit masks for the SAMD architecture.
// You should not need to change these macros, as they are designed to work with the g_APinDescription array defined in the variant's pins_arduino.c file.
#define digitalPinToPort(P) (&(PORT->Group[g_APinDescription[P].ulPort]))
#define digitalPinToBitMask(P) (1 << g_APinDescription[P].ulPin)
// #define analogInPinToBit(P)        ( )
#define portOutputRegister(port) (&(port->OUT.reg))
#define portInputRegister(port) (&(port->IN.reg))
#define portModeRegister(port) (&(port->DIR.reg))
#define digitalPinHasPWM(P) (g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER)

/**
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

// LEDs
// Optional macros for user LEDs.
#define PIN_LED_8 (8)    // PC26 User Green
#define PIN_LED_9 (9)    // PC27 User Red
#define PIN_LED_13 (13)  // PC28 User Purple
#define PIN_LED_RXL (45) // PB23
#define PIN_LED_TXL (46) // PB24
#define PIN_LED PIN_LED_13
#define PIN_LED2 PIN_LED_8
#define PIN_LED3 PIN_LED_9
#define PIN_LED4 PIN_LED_RXL
#define PIN_LED5 PIN_LED_TXL
#define LED_BUILTIN PIN_LED_13
#define PIN_LED_ORANGE PIN_LED_13
#define PIN_LED_GREEN PIN_LED_8
#define PIN_LED_RED PIN_LED_9

/**
 * Analog pin definitions
 * Explicitly define each analog pin number to its corresponding digital pin number
 */

// Standard analog pins as defines
#define PIN_A0 (66)
#define PIN_A1 (PIN_A0 + 1)
#define PIN_A2 (PIN_A0 + 2)
#define PIN_A3 (PIN_A0 + 3)
#define PIN_A4 (PIN_A0 + 4)
#define PIN_A5 (PIN_A0 + 5)
#define PIN_A6 (PIN_A0 + 6)
#define PIN_A7 (PIN_A0 + 7)
#define PIN_A8 (PIN_A0 + 8)
#define PIN_A9 (PIN_A0 + 9)

#define PIN_A10 (4)
#define PIN_A11 (19)
#define PIN_A12 (20)
#define PIN_A13 (23)
#define PIN_A14 (24)
#define PIN_A15 (25)
#define PIN_A16 (26)
#define PIN_A17 (21)
#define PIN_A18 (17)

// DAC pins as defines
#define PIN_DAC0 PIN_A0
#define PIN_DAC1 PIN_A1

    // shorter forms as static constants
    static const uint8_t A0 = PIN_A0;
    static const uint8_t A1 = PIN_A1;
    static const uint8_t A2 = PIN_A2;
    static const uint8_t A3 = PIN_A3;
    static const uint8_t A4 = PIN_A4;
    static const uint8_t A5 = PIN_A5;
    static const uint8_t A6 = PIN_A6;
    static const uint8_t A7 = PIN_A7;

    static const uint8_t A8 = PIN_A8;
    static const uint8_t A9 = PIN_A9;
    static const uint8_t A10 = PIN_A10;
    static const uint8_t A11 = PIN_A11;
    static const uint8_t A12 = PIN_A12;
    static const uint8_t A13 = PIN_A13;
    static const uint8_t A14 = PIN_A14;
    static const uint8_t A15 = PIN_A15;
    static const uint8_t A16 = PIN_A16;
    static const uint8_t A17 = PIN_A17;
    static const uint8_t A18 = PIN_A18;

    static const uint8_t DAC0 = PIN_DAC0;
    static const uint8_t DAC1 = PIN_DAC1;

