SRGDamia1/SAMD-custom-board/board_data/variant.h
// resolution of the ADC (Analog to Digital Converter)
// This should be 12 for all SAMD boards
#define ADC_RESOLUTION 12

/**
 * USART (Serial) interfaces
 *
 * USART – Synchronous and Asynchronous Receiver and Transmitter
 *
 * Here you should define the pins and SERCOM pads used for each USART (serial) interface on your board.
 * You should end up with 5 defines for each serial interface:
 * - `PIN_SERIAL#_RX` - the digital pin number for the RX line of the serial interface, can be any SERCOM pad (0-3)
 * - `PIN_SERIAL#_TX` - the digital pin number for the TX line of the serial interface, must be SERCOM pad 0
 * - `PAD_SERIAL#_RX` - the SERCOM RX pad used for this serial interface (see below)
 * - `PAD_SERIAL#_TX` - the SERCOM TX pad used for this serial interface (see below)
 * - `SERCOM_SERIAL#` - the SERCOM instance used for this serial interface (e.g. sercom0, sercom1, etc.)
 *
 *
 * The UART Objects themselves are created in variant.cpp using one of two constructors
 *
 * `Uart(SERCOM *_s, uint8_t _pinRX, uint8_t _pinTX, SercomRXPad _padRX, SercomUartTXPad _padTX);`
 * `Uart(SERCOM *_s, uint8_t _pinRX, uint8_t _pinTX, SercomRXPad _padRX, SercomUartTXPad _padTX, uint8_t _pinRTS, uint8_t _pinCTS);`
 *
 * Rx Pad (`_padRX`) can be any pad (0-3) [CTLA.RXPO]
 *
 * - use one of `SERCOM_RX_PAD_0`, `SERCOM_RX_PAD_1`, `SERCOM_RX_PAD_2`, `SERCOM_RX_PAD_3`
 *
 *
 * TX Pad (`_padTX`) Options on a SAMD21:
 *
 * - `UART_TX_PAD_0` (0x0) - Tx on pad 0, XKC (when available) on pad 1
 * - `UART_TX_PAD_2` (0x1) - Tx on pad 2, XKC (when available) on pad 3
 * - `UART_TX_RTS_CTS_PAD_0_2_3` (0x2) - Tx on Pad 0, RTS on pad 2, CTS on pad 3
 *
 *
 * TX Pad (`_padTX`) Options on a SAMD/E51:
 *
 * @note The defines/enum values are not aligned with the proper values!
 * @see https://github.com/adafruit/ArduinoCore-samd/issues/368
 *
 * - `UART_TX_PAD_0` (0x0) - Tx on pad 0, XKC (when available) on pad 1
 * - `UART_TX_PAD_2` (0x1) - NOT VALID!
 * - `UART_TX_RTS_CTS_PAD_0_2_3` (0x2) - Tx on Pad 0, RTS on pad 2, CTS on pad 3
 * - (0x3) - Tx on Pad 0, XKC (when available) on pad 1, TE on pad 2
 */

// Serial1 (Bee)
#define SerialBee Serial1
#define PIN_SERIAL1_RX (14) // PB17 SERCOM5/PAD[1]
// ^ Can be any pad (0-3) on a SAMD51 or SAMD21
#define PIN_SERIAL1_TX (15) // PB16 SERCOM5/PAD[0]
// ^ Must always be pad 0
#define PAD_SERIAL1_TX (UART_TX_PAD_0)
#define PAD_SERIAL1_RX (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL1 sercom5

// Serial2 (Grove)
#define PIN_SERIAL2_RX (0) // PA17 SERCOM1/PAD[1]
#define PIN_SERIAL2_TX (1) // PA16 SERCOM1/PAD[0]
#define PAD_SERIAL2_TX (UART_TX_PAD_0)
#define PAD_SERIAL2_RX (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL2 sercom1

// Serial3 (Feather Wing Left)
#define PIN_SERIAL3_RX (64) // PC17 SERCOM6/PAD[1]
#define PIN_SERIAL3_TX (65) // PC16 SERCOM6/PAD[0]
#define PAD_SERIAL3_TX (UART_TX_PAD_0)
#define PAD_SERIAL3_RX (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL3 sercom6

// Serial4 (Feather Wing Right)
#define PIN_SERIAL4_RX (36) // PA13 SERCOM2/PAD[1]
#define PIN_SERIAL4_TX (37) // PA12 SERCOM2/PAD[0]
#define PAD_SERIAL4_TX (UART_TX_PAD_0)
#define PAD_SERIAL4_RX (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL4 sercom2

/**
 * SPI Interfaces
 *
 * SPI – Serial Peripheral Interface (Host operation)
 *
 * Here you should define the pins and SERCOM pads used for each SPI interface on your board.
 *
 * @note SPI interfaces are created in libraries/SPI.cpp of the Adafruit Core based on the defines below
 *
 * Data In (MISO in host operation) can be any pad (0-3) [CTLA.DIPO], but the real available values depend on what is selected as Data Out.
 *
 * - define `PAD_SPI#_RX` as one of:
 *   - `SERCOM_RX_PAD_0`
 *   - `SERCOM_RX_PAD_1`
 *   - `SERCOM_RX_PAD_2`
 *   - `SERCOM_RX_PAD_3`
 *
 *
 * TX Options on a SAMD21: [CTLA.DOPO]
 *
 * - define `PAD_SPI_TX` as one of:
 *   - `SPI_PAD_0_SCK_1` (0x0) - Data Out (MOSI) on pad 0, SCK is on pad 1, Hardware SS is on pad 2 (Only pad 3 left for MISO)
 *   - `SPI_PAD_2_SCK_3` (0x1) - Data Out (MOSI) on pad 2, SCK is on pad 3, Hardware SS is on pad 1 (Only pad 0 left for MISO)
 *   - `SPI_PAD_3_SCK_1` (0x2) - Data Out (MOSI) on Pad 3, SCK is on pad 1, Hardware SS is on pad 2 (Only pad 0 left for MISO)
 *   - `SPI_PAD_0_SCK_3` (0x3) - Data Out (MOSI) on Pad 0, SCK is on pad 3, Hardware SS is on pad 1 (Only pad 2 left for MISO)
 *
 *
 * TX Options on a SAMD/E51: [CTLA.DOPO]
 *
 * - define `PAD_SPI_TX` as one of: *
 *   - `SPI_PAD_0_SCK_1` (0x0) - Data Out (MOSI) on pad 0, SCK is on pad 1, Hardware SS is on pad 2 (Only pad 3 left for MISO)
 *   - `SPI_PAD_3_SCK_1` (0x2) - Data Out (MOSI) on Pad 3, SCK is on pad 1, Hardware SS is on pad 2 (Only pad 0 left for MISO)
 *   - `SPI_PAD_2_SCK_3` (0x1) and `SPI_PAD_0_SCK_3` (0x3) are NOT VALID on the SAMD/E 51!
 *
 * In the Adafruit core, hardware SS (slave select) is used by default.
 * This means that the SS pin must be the specified pad on the SERCOM restricting you to using only the single slave attached to that SS pin.
 *
 * If you want to use multiple slaves on the same bus, you can disable hardware SPI select.
 * Doing this allows you to use any GPIO pin(s) as the SS pin(s), and requires you to manually set that pin low before communicating with the desired slave.
 * To emulate the functionality of the hardware SS with a manual SS pin, you should drive the SS pin low for a minimum of one baud cycle before transmission begins, and stays low for a minimum of one baud cycle after transmission completes.
 *
 * To disable hardware slave select, you must add the following code (applies to SAMD21 and 51):
 * ```cpp
 * # include "wiring_private.h"  // pinPeripheral() function
 * // Set the CTRLB register
 * SERCOM#->SPI.CTRLB.bit.MSSEN = 0; // Disable MSSEN
 * while( SERCOM#->SPI.SYNCBUSY.bit.CTRLB == 1 );  // not required, the MSSEN bit is not synchronized
 * // Set the pin peripheral of the SS pin to DIO (just in case it had been PIO_SERCOM or PIO_SERCOM_ALT)
 * pinPeripheral( ss_pin_number, PIO_DIGITAL);
 * ```
 */
#define SPI_INTERFACES_COUNT 1

// SD Card SPI
#define PIN_SPI_MOSI (33) // D33 PB12 SPI MOSI SERCOM4/PAD[0]
// ^ Digital pin for SPI Data Out (MOSI as host, MISO as client) can be pad 0 or 3 on a SAMD51 or 0, 2, or 3 on a SAMD21
#define PIN_SPI_SCK (34) // D34 PB13 SPI SCK SERCOM4/PAD[1]
// ^ Digital pin for SPI SCK must be pad 1 on a SAMD51 or 1 or 3 on a SAMD21
#define PIN_SPI_SS (35) // D35 PB11 SPI (SD card/other) CS SERCOM4/PAD[2]
// ^ Digital pin for SPI CS must always be pad 2
#define PIN_SPI_MISO (32) // D32 PB15 SPI MISO SERCOM4/PAD[3]
// ^ Digital pin for SPI MISO SERCOM4/PAD[3]
#define PERIPH_SPI sercom4
// ^ the SERCOM instance used for this SPI interface (e.g. sercom0, sercom1, etc.)

// Set the entire Tx config here
#define PAD_SPI_TX SPI_PAD_0_SCK_1 // Data Out (MOSI) on pad 0, SCK is on pad 1, Hardware SS is on pad 2 (Only pad 3 left for MISO)
// MISO - Rx - Main In, Sub Out (master in, slave out)
#define PAD_SPI_RX SERCOM_RX_PAD_3 // MISO is on pad 3

